gitb-test-resources/src/main/resources/test-repository/Sample/Actor1/artifacts/SOAPMessage.xml

<?xml version="1.0" encoding="UTF-8"?>
<s:Envelope
		xmlns:s="http://www.w3.org/2003/05/soap-envelope"
		xmlns:wst="http://www.w3.org/2002/ws/ra/edcopies/ws-tra"
		xmlns:wsa="http://www.w3.org/2005/08/addressing"
		xmlns:ids="http://busdox.org/transport/identifiers/1.0/"
		xmlns:lime="http://busdox.org/transport/lime/1.0/"
		xmlns:xs="http://www.w3.org/2001/XMLSchema">
	<s:Header>
		<wsa:ReplyTo>
			<wsa:Address>http://www.fabrikam123.example.org/sender</wsa:Address>
		</wsa:ReplyTo>
		<wsa:To>http://195.142.27.185:6000/services/messagechannel</wsa:To>
		<wsa:Action>http://www.w3.org/2002/ws/ra/edcopies/ws-tra/Create</wsa:Action>
		<wsa:MessageID>urn:uuid:00000000-0000-0000-C000-000000000048</wsa:MessageID>
		<ids:RecipientIdentifier scheme="http://busdox.org/profiles/serviceMetadata/1.0/UniversalBusinessIdentifier/1.0/">0010:1387</ids:RecipientIdentifier>
		<ids:ChannelIdentifier>outbound</ids:ChannelIdentifier>
		<ids:SenderIdentifier scheme="http://busdox.org/profiles/serviceMetadata/1.0/UniversalBusinessIdentifier/1.0/">0010:1389</ids:SenderIdentifier>
		<ids:DocumentIdentifier scheme="http://busdox.org/profiles/serviceMetadata/1.0/DocumentIdentifierType/QNameSubtype/">urn:oasis:names:specification:ubl:schema:xsd:Invoice-2::Invoice##UBL-2.0</ids:DocumentIdentifier>
		<ids:ProcessIdentifier scheme="http://busdox.org/processIdentifiers/1.0/UBL/CENBII/1.0/">BII04</ids:ProcessIdentifier>
	</s:Header>
	<s:Body>
		<wst:Create/>
	</s:Body>
</s:Envelope>

